Reports/А_РасшифровкаЗадолженностиПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>А_РасшифровкаЗадолженностиПодразделений</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ПрочиеАктивыПассивы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочиеАктивыПассивы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсточниковДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиУправленческогоБаланса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсточникДвижений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьИсточникиДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПрочиеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочиеРасходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеглБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостояннаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпрБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПрочихАктивов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспределениеПрочихЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляСтоимости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорНаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсточникДвижений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьИсточникиДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектУчетаРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсточниковДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаPL</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ФормыPL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ИсточникиУправленческогоБаланса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ИсточникиУправленческогоБаланса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АмортизацияНМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмортизацияОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваБезналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваВКассахККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваНаличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваУПодотчетныхЛиц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартииПрочихРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданнаяВозвратнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныеСертификаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятаяВозвратнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивыПассивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоФинансовымИнструментам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКлиентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКлиентамиПоДокументам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПоставщиками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКлиентамиПоСрокам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПоставщикамиПоДокументам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СебестоимостьТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПоставщикамиПоСрокам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервыПоСомнительнымДолгам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьНМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыКОформлениюОтчетовКомитенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудозатратыНезавершенногоПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходыНезавершенногоПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиКОформлениюОтчетовПринципалу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничныеПродажиПодакцизныхТоваров</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/А_ДисбалансПоПодразделению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>А_ДисбалансПоПодразделению</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СтатьиБаланса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/А_РасшифровкаЗадолженностиПодразделений/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Регистрация в подсистеме "Дополнительные отчеты и обработки".
Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет");
	ПараметрыРегистрации.Вставить("Наименование", "Расшифровка задолженности подразделений");
	ПараметрыРегистрации.Вставить("Версия", "1.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация",
		"Природа создания ВзаимозачетЗадолженности по фактическим движениям ПрочиеАктивыПассивы");
	ПараметрыРегистрации.Вставить("Команды", Новый ТаблицаЗначений);
	Возврат ПараметрыРегистрации;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Программная компоновка результата: данные готовятся в ПолучитьТаблицуРасшифровки,
// затем передаются в СКД как внешний набор данных "Расшифровка".
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	УстановитьПривилегированныйРежим(Истина);

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();

	// Период берём НАПРЯМУЮ из параметра Период (СтандартныйПериод) — так же, как типовой
	// отчёт ВедомостьРасчетовСПартнерами (УстановитьДатуОтчета) и родственный
	// А_СравнитьОстаткиВзаиморасчетыКонтрагентыЕРПсBASБухгалтерия (ПриКомпоновкеРезультата).
	// Параметры СКД НачалоПериода/ОкончаниеПериода заданы выражением &Период.ДатаНачала /
	// КОНЕЦПЕРИОДА(&Период.ДатаОкончания) — их вычисляет компоновщик при компоновке ЗАПРОСА,
	// но данные здесь готовятся ПРОГРАММНО ДО компоновки, поэтому в ПараметрыДанных лежит
	// пустой дефолт (0001-01-01) и фильтр охватил бы все периоды.
	ПериодОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение;

	Параметры = Новый Структура;
	Параметры.Вставить("НачалоПериода",        ПериодОтчета.ДатаНачала);
	Параметры.Вставить("ОкончаниеПериода",     КонецДня(ПериодОтчета.ДатаОкончания));

	ТаблицаРасшифровки = ПолучитьТаблицуРасшифровки(Параметры);

	ВнешниеНаборыДанных = Новый Структура("Расшифровка", ТаблицаРасшифровки);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Главная функция данных. Строит плоскую ТЗ грейна
// (Партнёр-перспектива x Взаимозачёт x Сторона-ПАП).
Функция ПолучитьТаблицуРасшифровки(Параметры) Экспорт

	ТЗ = СоздатьПустуюТаблицу();

	НачПериода = ?(ЗначениеЗаполнено(Параметры.НачалоПериода), Параметры.НачалоПериода, '00010101');
	ОконПериода = ?(ЗначениеЗаполнено(Параметры.ОкончаниеПериода),
		КонецДня(Параметры.ОкончаниеПериода), '39991231235959');

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Нач", НачПериода);
	Запрос.УстановитьПараметр("Кон", ОконПериода);
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Вз.Ссылка КАК Взаимозачет,
	|	Вз.Дата КАК Дата,
	|	Вз.СуммаРегл КАК СуммаРегл,
	|	Вз.Проведен КАК Проведен,
	|	ВЫРАЗИТЬ(Вз.КонтрагентДебитор КАК Справочник.Контрагенты).Партнер КАК ПартнерДебитор,
	|	ВЫРАЗИТЬ(Вз.КонтрагентКредитор КАК Справочник.Контрагенты).Партнер КАК ПартнерКредитор,
	|	ВЫРАЗИТЬ(Вз.КонтрагентДебитор КАК Справочник.Контрагенты).Партнер.А_Подразделение КАК ПодрДебитор,
	|	ВЫРАЗИТЬ(Вз.КонтрагентКредитор КАК Справочник.Контрагенты).Партнер.А_Подразделение КАК ПодрКредитор,
	|	Вз.А_ДокументОснованиеДляБаланса КАК Основание,
	|	Вз.А_СтатьяДисбалансаПоПодразделению КАК ХранимаяСтатья
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности КАК Вз
	|ГДЕ
	|	Вз.Дата МЕЖДУ &Нач И &Кон
	|	И Вз.А_ДокументОснованиеДляБаланса <> НЕОПРЕДЕЛЕНО
	|	И НЕ Вз.ПометкаУдаления";

	// Отчёт по ВСЕМ проведённым документам — фильтр по проведённости безусловный.
	ТекстЗапроса = ТекстЗапроса + "
	|	И Вз.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Вз.Дата";

	Запрос.Текст = ТекстЗапроса;
	ВыборкаВз = Запрос.Выполнить().Выбрать();

	Пока ВыборкаВз.Следующий() Цикл

		// Стороны ограничиваем ДВУМЯ подразделениями ИМЕННО ЭТОГО взаимозачёта.
		// Одно основание может расщепляться на несколько пар (несколько взаимозачётов),
		// поэтому брать все стороны документа нельзя — попадут чужие подразделения.
		Если НЕ ЗначениеЗаполнено(ВыборкаВз.ПодрДебитор) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаВз.ПодрКредитор)
			ИЛИ ВыборкаВз.ПодрДебитор = ВыборкаВз.ПодрКредитор Тогда
			Продолжить;
		КонецЕсли;

		Стороны = ПолучитьСтороныПАП(ВыборкаВз.Основание, ВыборкаВз.ПодрДебитор, ВыборкаВз.ПодрКредитор);
		Если Стороны.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		// Доминирующая статья каждой стороны пары (по знаковому сальдо в своём подразделении).
		СторонаДеб = ДоминирующаяСторона(Стороны, ВыборкаВз.ПодрДебитор, Истина);
		СторонаКред = ДоминирующаяСторона(Стороны, ВыборкаВз.ПодрКредитор, Ложь);
		Если СторонаДеб = Неопределено ИЛИ СторонаКред = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ФактСтатьяДебитора = СторонаДеб.Статья;
		ФактСтатьяКредитора = СторонаКред.Статья;

		// Флаг расхождения остаётся как информативная колонка (подсветка), но НЕ фильтрует выборку.
		ФлагРасхождения = ЕстьРасхождение(ВыборкаВз.ХранимаяСтатья, ФактСтатьяДебитора, ФактСтатьяКредитора);

		ТипОперации = ТипОперацииОснования(ВыборкаВз.Основание);
		СтатьяДвижения = СтатьяДвиженияОснования(ВыборкаВз.Основание);
		ДоговорДеб = ПолучитьДоговорСтороны(ВыборкаВз.Взаимозачет, "ДебиторскаяЗадолженность");
		ДоговорКред = ПолучитьДоговорСтороны(ВыборкаВз.Взаимозачет, "КредиторскаяЗадолженность");

		// Ровно две стороны пары; сумма стороны = СуммаРегл взаимозачёта (пер-пара, а не сырое сальдо документа).
		МассивСторон = Новый Массив;
		МассивСторон.Добавить(НоваяСторонаПары(ВыборкаВз.ПодрДебитор, СторонаДеб, ВыборкаВз.СуммаРегл, "Дебитор"));
		МассивСторон.Добавить(НоваяСторонаПары(ВыборкаВз.ПодрКредитор, СторонаКред, -ВыборкаВз.СуммаРегл, "Кредитор"));

		Для Каждого Сторона Из МассивСторон Цикл
			Расшифровка = ДекодироватьСторону(ВыборкаВз.Основание, Сторона);

			// Перспектива 1: партнёр = дебитор взаимозачёта, встречное подразделение = подр. кредитора.
			ДобавитьСтроку(ТЗ, ВыборкаВз, ВыборкаВз.ПартнерДебитор, ДоговорДеб, ВыборкаВз.ПодрКредитор,
				"Дебитор", ФактСтатьяДебитора, ФактСтатьяКредитора, ФлагРасхождения,
				ТипОперации, СтатьяДвижения, Сторона, Сторона.СторонаЗнак, Расшифровка);

			// Перспектива 2: партнёр = кредитор взаимозачёта, встречное подразделение = подр. дебитора.
			ДобавитьСтроку(ТЗ, ВыборкаВз, ВыборкаВз.ПартнерКредитор, ДоговорКред, ВыборкаВз.ПодрДебитор,
				"Кредитор", ФактСтатьяДебитора, ФактСтатьяКредитора, ФлагРасхождения,
				ТипОперации, СтатьяДвижения, Сторона, Сторона.СторонаЗнак, Расшифровка);
		КонецЦикла;

	КонецЦикла;

	Возврат ТЗ;

КонецФункции

// Факт-пара статей: signed-сальдо (Приход - Расход) по Подразделение x Статья x Источник.
Функция ПолучитьСтороныПАП(Основание, ПодрДебитор, ПодрКредитор)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("ПодрДеб", ПодрДебитор);
	Запрос.УстановитьПараметр("ПодрКред", ПодрКредитор);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПАП.Подразделение КАК Подразделение,
	|	ПАП.Статья КАК Статья,
	|	ПАП.Источник КАК Источник,
	|	СУММА(ВЫБОР
	|			КОГДА ПАП.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ПАП.Сумма
	|			ИНАЧЕ -ПАП.Сумма
	|		КОНЕЦ) КАК Сальдо
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы КАК ПАП
	|ГДЕ
	|	ПАП.Регистратор = &Основание
	|	И ПАП.Подразделение В (&ПодрДеб, &ПодрКред)
	|СГРУППИРОВАТЬ ПО
	|	ПАП.Подразделение,
	|	ПАП.Статья,
	|	ПАП.Источник
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА ПАП.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ПАП.Сумма
	|			ИНАЧЕ -ПАП.Сумма
	|		КОНЕЦ) <> 0";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Доминирующая (по знаковому сальдо) строка стороны для заданного подразделения пары.
// БратьМаксимум = Истина для дебиторской стороны (наибольшее сальдо), Ложь — для кредиторской (наименьшее).
Функция ДоминирующаяСторона(Стороны, Подразделение, БратьМаксимум)

	Лучшая = Неопределено;
	Для Каждого Стр Из Стороны Цикл
		Если Стр.Подразделение <> Подразделение Тогда
			Продолжить;
		КонецЕсли;
		Если Лучшая = Неопределено
			ИЛИ (БратьМаксимум И Стр.Сальдо > Лучшая.Сальдо)
			ИЛИ (НЕ БратьМаксимум И Стр.Сальдо < Лучшая.Сальдо) Тогда
			Лучшая = Стр;
		КонецЕсли;
	КонецЦикла;
	Возврат Лучшая;

КонецФункции

// Структура одной стороны пары взаимозачёта.
// Сальдо = ±СуммаРегл взаимозачёта (сумма ЭТОЙ пары, а не сырое сальдо документа-основания).
Функция НоваяСторонаПары(Подразделение, СторонаПАП, Сальдо, СторонаЗнак)

	Стр = Новый Структура;
	Стр.Вставить("Подразделение", Подразделение);
	Стр.Вставить("Статья",        СторонаПАП.Статья);
	Стр.Вставить("Источник",      СторонаПАП.Источник);
	Стр.Вставить("Сальдо",        Сальдо);
	Стр.Вставить("СторонаЗнак",   СторонаЗнак);
	Возврат Стр;

КонецФункции

// Диспетчер декодирования аналитики по Источник (рецепт §2 спецификации).
Функция ДекодироватьСторону(Основание, Сторона)

	Результат = Новый Структура("Аналитика1, Аналитика2, Аналитика3", "", "", "");
	Источник = Сторона.Источник;
	ПеречИст = Перечисления.ИсточникиУправленческогоБаланса;

	Если Источник = ПеречИст.СебестоимостьТоваров Тогда
		ДекодСебестоимость(Основание, Сторона.Подразделение, Результат);

	ИначеЕсли Источник = ПеречИст.РасчетыСПоставщикамиПоСрокам
		ИЛИ Источник = ПеречИст.РасчетыСКлиентамиПоСрокам Тогда
		ДекодРасчеты(Основание, Источник, Результат);

	ИначеЕсли Источник = ПеречИст.ПрочиеРасходы
		ИЛИ Источник = ПеречИст.ПартииПрочихРасходов Тогда
		ДекодПрочиеРасходы(Основание, Сторона.Подразделение, Результат);

	ИначеЕсли Источник = ПеречИст.ДенежныеСредстваБезналичные
		ИЛИ Источник = ПеречИст.ДенежныеСредстваНаличные
		ИЛИ Источник = ПеречИст.ДенежныеСредстваВПути
		ИЛИ Источник = ПеречИст.ДенежныеСредстваУПодотчетныхЛиц Тогда
		ДекодПоАналитикеПАП(Основание, Источник, Результат);

	Иначе
		// Оплата труда (А_ВзаиморасчетыССотрудниками) и прочие источники — берём ПАП.Аналитика.
		ДекодПоАналитикеПАП(Основание, Источник, Результат);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Себестоимость -> Аналитика1=Склад.Подразделение, Аналитика2=Склад, Аналитика3=Номенклатура (склейка).
Процедура ДекодСебестоимость(Основание, СторонаПодразделение, Результат)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Подразделение", СторонаПодразделение);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕ(Себ.АналитикаУчетаНоменклатуры.МестоХранения.Подразделение) КАК СкладПодразделение,
	|	ПРЕДСТАВЛЕНИЕ(Себ.АналитикаУчетаНоменклатуры.МестоХранения) КАК Склад,
	|	ПРЕДСТАВЛЕНИЕ(Себ.АналитикаУчетаНоменклатуры.Номенклатура) КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себ
	|ГДЕ
	|	Себ.Регистратор = &Основание
	|	И Себ.АналитикаУчетаНоменклатуры.МестоХранения.Подразделение = &Подразделение";

	Выборка = Запрос.Выполнить().Выбрать();
	Склад = "";
	СкладПодр = "";
	Номенклатуры = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Склад) Тогда
			Склад = Выборка.Склад;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СкладПодразделение) Тогда
			СкладПодр = Выборка.СкладПодразделение;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Номенклатура) И Номенклатуры.Найти(Выборка.Номенклатура) = Неопределено Тогда
			Номенклатуры.Добавить(Выборка.Номенклатура);
		КонецЕсли;
	КонецЦикла;

	Результат.Аналитика1 = СкладПодр;
	Результат.Аналитика2 = Склад;
	Результат.Аналитика3 = СтрСоединить(Номенклатуры, "; ");

КонецПроцедуры

// Расчёты с клиентами/поставщиками -> Аналитика1=ПодрУслуг, Аналитика2=Контрагент, Аналитика3=Договор.
Процедура ДекодРасчеты(Основание, Источник, Результат)

	Если Источник = Перечисления.ИсточникиУправленческогоБаланса.РасчетыСКлиентамиПоСрокам Тогда
		ИмяРегистра = "РасчетыСКлиентамиПоСрокам";
	Иначе
		ИмяРегистра = "РасчетыСПоставщикамиПоСрокам";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕ(Расч.АналитикаУчетаПоПартнерам.Контрагент) КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(Расч.ОбъектРасчетов.Договор) КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(Расч.ОбъектРасчетов.Договор.А_ПодразделениеОказаниеУслугПодразделению) КАК ПодрУслуг
	|ИЗ
	|	РегистрНакопления." + ИмяРегистра + " КАК Расч
	|ГДЕ
	|	Расч.ДокументРегистратор = &Основание";

	Выборка = Запрос.Выполнить().Выбрать();
	Контрагенты = Новый Массив;
	Договоры = Новый Массив;
	ПодрУслуг = "";
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Контрагент) И Контрагенты.Найти(Выборка.Контрагент) = Неопределено Тогда
			Контрагенты.Добавить(Выборка.Контрагент);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Договор) И Договоры.Найти(Выборка.Договор) = Неопределено Тогда
			Договоры.Добавить(Выборка.Договор);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ПодрУслуг) Тогда
			ПодрУслуг = Выборка.ПодрУслуг;
		КонецЕсли;
	КонецЦикла;

	Результат.Аналитика1 = ПодрУслуг;
	Результат.Аналитика2 = СтрСоединить(Контрагенты, "; ");
	Результат.Аналитика3 = СтрСоединить(Договоры, "; ");

КонецПроцедуры

// Прочие расходы / Партии прочих расходов -> Аналитика1=СтатьяРасходов.
Процедура ДекодПрочиеРасходы(Основание, СторонаПодразделение, Результат)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Подразделение", СторонаПодразделение);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕ(ПР.СтатьяРасходов) КАК СтатьяРасходов
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ПР
	|ГДЕ
	|	ПР.Регистратор = &Основание
	|	И ПР.Подразделение = &Подразделение";

	Выборка = Запрос.Выполнить().Выбрать();
	Статьи = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СтатьяРасходов) И Статьи.Найти(Выборка.СтатьяРасходов) = Неопределено Тогда
			Статьи.Добавить(Выборка.СтатьяРасходов);
		КонецЕсли;
	КонецЦикла;

	Результат.Аналитика1 = СтрСоединить(Статьи, "; ");

КонецПроцедуры

// Деньги / зарплата / прочее -> Аналитика1 = ПАП.Аналитика (Банк/Касса/ФизЛицо/...).
Процедура ДекодПоАналитикеПАП(Основание, Источник, Результат)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕ(ПАП.Аналитика) КАК Аналитика
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы КАК ПАП
	|ГДЕ
	|	ПАП.Регистратор = &Основание
	|	И ПАП.Источник = &Источник";

	Выборка = Запрос.Выполнить().Выбрать();
	Значения = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Аналитика) И Значения.Найти(Выборка.Аналитика) = Неопределено Тогда
			Значения.Добавить(Выборка.Аналитика);
		КонецЕсли;
	КонецЦикла;

	Результат.Аналитика1 = СтрСоединить(Значения, "; ");

КонецПроцедуры

// Сравнение хранимой пары статей (ТЧ СтатьиБаланса) с фактической парой из ПАП.
Функция ЕстьРасхождение(ХранимаяСтатья, ФактСтатьяДебитора, ФактСтатьяКредитора)

	Если НЕ ЗначениеЗаполнено(ХранимаяСтатья) Тогда
		Возврат Истина;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ХранимаяСтатья);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатьиБаланса.Статья КАК Статья
	|ИЗ
	|	Справочник.А_ДисбалансПоПодразделению.СтатьиБаланса КАК СтатьиБаланса
	|ГДЕ
	|	СтатьиБаланса.Ссылка = &Ссылка
	|	И СтатьиБаланса.Статья <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)";

	ХранимыеСтатьи = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ХранимыеСтатьи.Вставить(Выборка.Статья, Истина);
	КонецЦикла;

	Если ХранимыеСтатьи.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	// Факт-множество {ФактДеб, ФактКред}.
	ФактМножество = Новый Соответствие;
	ФактМножество.Вставить(ФактСтатьяДебитора, Истина);
	ФактМножество.Вставить(ФактСтатьяКредитора, Истина);

	Если ХранимыеСтатьи.Количество() <> ФактМножество.Количество() Тогда
		Возврат Истина;
	КонецЕсли;

	Для Каждого КлючЗначение Из ФактМножество Цикл
		Если ХранимыеСтатьи.Получить(КлючЗначение.Ключ) = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Тип операции основания = синоним метаданных документа-основания.
Функция ТипОперацииОснования(Основание)

	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат "";
	КонецЕсли;
	МетаОснования = Основание.Метаданные();
	Если ЗначениеЗаполнено(МетаОснования.Синоним) Тогда
		Возврат МетаОснования.Синоним;
	КонецЕсли;
	Возврат МетаОснования.Имя;

КонецФункции

// Статья движения денег / суть операции по документу-основанию.
// Источник = реквизит документа по его типу; если реквизит пуст или тип не сопоставлен
// явно — суть = синоним типа документа (та же логика, что ТипОперацииОснования).
Функция СтатьяДвиженияОснования(Основание)

	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат "";
	КонецЕсли;

	ИмяТипа = Основание.Метаданные().Имя;
	Значение = Неопределено;

	Если ИмяТипа = "ПриобретениеТоваровУслуг" Тогда
		Значение = Основание.А_СтатьяДвиженияДенежныхСредств;
	ИначеЕсли ИмяТипа = "СписаниеБезналичныхДенежныхСредств"
		ИЛИ ИмяТипа = "ПоступлениеБезналичныхДенежныхСредств"
		ИЛИ ИмяТипа = "ПриходныйКассовыйОрдер"
		ИЛИ ИмяТипа = "РасходныйКассовыйОрдер" Тогда
		Значение = Основание.СтатьяДвиженияДенежныхСредств;
	ИначеЕсли ИмяТипа = "СписаниеНедостачТоваров" Тогда
		Значение = Основание.СтатьяРасходов;
	ИначеЕсли ИмяТипа = "ПеремещениеТоваров" Тогда
		Возврат "Передача товара на другое подразделение";
	ИначеЕсли ИмяТипа = "А_ПередачаНачисленийМеждуПодразделениями" Тогда
		Возврат "Передача начислений ЗП между подразделениями";
	ИначеЕсли ИмяТипа = "РеализацияТоваровУслуг" Тогда
		Возврат "Реализация товаров и услуг";
	ИначеЕсли ИмяТипа = "ПриобретениеУслугПрочихАктивов" Тогда
		Возврат "Приобретение услуг / прочих активов";
	ИначеЕсли ИмяТипа = "ВзаимозачетЗадолженности" Тогда
		Возврат "Внутренний взаимозачёт";
	КонецЕсли;

	Если Значение <> Неопределено И ЗначениеЗаполнено(Значение) Тогда
		Возврат Строка(Значение);
	КонецЕсли;

	Возврат ТипОперацииОснования(Основание);

КонецФункции

// Договор стороны взаимозачёта: первый непустой ОбъектРасчетов.Договор (ДоговорыКонтрагентов)
// из ТЧ задолженности. ИмяТЧ = "ДебиторскаяЗадолженность" | "КредиторскаяЗадолженность".
Функция ПолучитьДоговорСтороны(Взаимозачет, ИмяТЧ)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Взаимозачет", Взаимозачет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЧ.ОбъектРасчетов.Договор КАК Справочник.ДоговорыКонтрагентов) КАК Договор
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности." + ИмяТЧ + " КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Взаимозачет";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Договор) Тогда
			Возврат Выборка.Договор;
		КонецЕсли;
	КонецЦикла;
	Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();

КонецФункции

// Добавление одной плоской строки набора данных (грейн = перспектива x сторона).
Процедура ДобавитьСтроку(ТЗ, ВыборкаВз, Партнер, Договор, ВстречноеПодразделение, РольКонтрагента,
	ФактСтатьяДебитора, ФактСтатьяКредитора, ФлагРасхождения, ТипОперации, СтатьяДвижения, Сторона, СторонаЗнак, Расшифровка)

	Строка = ТЗ.Добавить();
	Строка.Партнер = Партнер;
	Строка.Договор = Договор;
	Строка.ВстречноеПодразделение = ВстречноеПодразделение;
	Строка.ХранимаяСтатьяДисбаланса = ВыборкаВз.ХранимаяСтатья;
	Строка.Взаимозачет = ВыборкаВз.Взаимозачет;
	Строка.РольКонтрагента = РольКонтрагента;
	Строка.Дата = ВыборкаВз.Дата;
	Строка.СуммаРегл = ВыборкаВз.СуммаРегл;
	Строка.Проведен = ВыборкаВз.Проведен;
	Строка.Основание = ВыборкаВз.Основание;
	Строка.ТипОперации = ТипОперации;
	Строка.СтатьяДвижения = СтатьяДвижения;
	Строка.ФактСтатьяДебитора = ФактСтатьяДебитора;
	Строка.ФактСтатьяКредитора = ФактСтатьяКредитора;
	Строка.ФлагРасхождения = ФлагРасхождения;
	Строка.СторонаЗнак = СторонаЗнак;
	Строка.СторонаПодразделение = Сторона.Подразделение;
	Строка.СторонаСтатья = Сторона.Статья;
	Строка.СторонаИсточник = Сторона.Источник;
	// Сумма стороны делится на Приход (увеличение долга — дебиторская сторона, ПАП ВидДвижения Приход)
	// и Расход (уменьшение долга — кредиторская сторона, ПАП ВидДвижения Расход). Каждый взаимозачёт даёт
	// ровно одну сторону в Приход и одну в Расход → СУММА по группировкам считает сумму один раз.
	Строка.Приход = ?(СторонаЗнак = "Дебитор", ВыборкаВз.СуммаРегл, 0);
	Строка.Расход = ?(СторонаЗнак = "Кредитор", ВыборкаВз.СуммаРегл, 0);
	Строка.Аналитика1 = Расшифровка.Аналитика1;
	Строка.Аналитика2 = Расшифровка.Аналитика2;
	Строка.Аналитика3 = Расшифровка.Аналитика3;

КонецПроцедуры

// Создание пустой ТЗ набора данных (Договор + СтатьяДвижения добавлены к базовым; типы — см. §4 спецификации).
Функция СоздатьПустуюТаблицу() Экспорт

	ТЗ = Новый ТаблицаЗначений;
	Колонки = ТЗ.Колонки;

	ОписаниеСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеДата = Новый ОписаниеТипов("Дата");
	ОписаниеБулево = Новый ОписаниеТипов("Булево");

	Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	Колонки.Добавить("ВстречноеПодразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	Колонки.Добавить("ХранимаяСтатьяДисбаланса", Новый ОписаниеТипов("СправочникСсылка.А_ДисбалансПоПодразделению"));
	Колонки.Добавить("Взаимозачет", Новый ОписаниеТипов("ДокументСсылка.ВзаимозачетЗадолженности"));
	Колонки.Добавить("РольКонтрагента", ОписаниеСтрока);
	Колонки.Добавить("Дата", ОписаниеДата);
	Колонки.Добавить("СуммаРегл", ОписаниеЧисло);
	Колонки.Добавить("Проведен", ОписаниеБулево);
	Колонки.Добавить("Основание", Новый ОписаниеТипов());
	Колонки.Добавить("ТипОперации", ОписаниеСтрока);
	Колонки.Добавить("СтатьяДвижения", ОписаниеСтрока);
	Колонки.Добавить("ФактСтатьяДебитора", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
	Колонки.Добавить("ФактСтатьяКредитора", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
	Колонки.Добавить("ФлагРасхождения", ОписаниеБулево);
	Колонки.Добавить("СторонаЗнак", ОписаниеСтрока);
	Колонки.Добавить("СторонаПодразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	Колонки.Добавить("СторонаСтатья", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
	Колонки.Добавить("СторонаИсточник", Новый ОписаниеТипов("ПеречислениеСсылка.ИсточникиУправленческогоБаланса"));
	Колонки.Добавить("Приход", ОписаниеЧисло);
	Колонки.Добавить("Расход", ОписаниеЧисло);
	Колонки.Добавить("Аналитика1", ОписаниеСтрока);
	Колонки.Добавить("Аналитика2", ОписаниеСтрока);
	Колонки.Добавить("Аналитика3", ОписаниеСтрока);

	Возврат ТЗ;

КонецФункции

// Чтение значения параметра данных из настроек СКД.
Функция ЗначениеПараметраНастроек(Настройки, ИмяПараметра)

	ЗначениеПараметра = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ЗначениеПараметра.Значение;

КонецФункции

#КонецОбласти

#КонецЕсли
